[
  {
    "platform": "Reddit",
    "content": "Background : Started with pain in lower back in April 2025, thought gastric asI was diagnosed with duodenitis in March 2025.\n\ngeneral physician booked for am spine mri.\n\nFindings : Attached the report, it says mild disc bilge at l4 and l5 with no nerve impingementation.\n\nPhysical therapy: Started with PT and pain didn't decrease. tingling and burning pain through Both legs.\n\nMay 2025 : Went on car drive and had jerk while braking multiple times .noticed burning pain in penis on urinating. Got another mri with the same results. No changes.Got angiogram too to check any nerve damage.all were normal\n\nPain became unbearable and nights with no sleep.. \n\nshifted near office and this time got some time to rest myself.\n\nCompletely stopped byke and car. \n\nSept 2025 ; had to bend multiple times on festival day and same burning pain in penis came back and this time very strong. Got another mri and there were no changes in report expect bulge is slightly touching the nerve both sides.. Rest all are normal. MRI film has no differences compared to previous \n\nDecember 2025 : started slow walking and gradually increased to 5 to 6 kms avg per day. no tingling or nerve pain was very less and I used to get only leg pain dud to longs walks.\n\nwas getting confident as I was walking and getting stable\n\njan 2026 : two weeks back all of a sudden pain started when I compleyed my morning 2km walk.flare up is still there with burning and tingling.\n\nRight now feeling no hope as it is almost a year and pain is not even going off.. it's always on and off like 1 week of confidence and flare up with no hopes...\n\nTried physio , exercisea , stretches , muscle release , all gives relief for very short period\n\n I am really confused what is causing my flare ups\n\nRight now completely depressed with very sucidal thoughts as I was regular hiker traveller and life seems to be end for me.\n\nNot requesting advice,just want to throw all of my pain here \n\nconsulated more than 20 docs . all says report is very normal no serious.",
    "author": "LowerReception7508",
    "date": "2026-01-26T20:18:47",
    "url": "https://www.reddit.com/gallery/1qni0ol"
  },
  {
    "platform": "Reddit",
    "content": "Asics GT 2000 13 for Easy and long runs and Puma Galaxis pro for intervals and tempo threshold runs.\n\nGot Asics for like Rs. 3450 and Puma for Rs. 2250",
    "author": "Current_Necessary366",
    "date": "2026-01-26T20:02:20",
    "url": "https://www.reddit.com/gallery/1qnhle0"
  },
  {
    "platform": "Reddit",
    "content": "Please, feel free to add any events below! Check out the [**Visitor's Guide**](https://old.reddit.com/r/StLouis/wiki/visitorguide) for more things to do around town!\n\nLooking to meet up with people? Check out [**Meetup St. Louis**](https://www.meetup.com/cities/us/mo/saint_louis/).\n\n***Keep scrolling to see Trivia Nights, Live Theater, Live Music, Sporting Events, Local Comedy, Farmers Markets and more!***\n\n[**Beginners Night at St. Louis Chess Club**](https://saintlouischessclub.org/event/beginners-knight/)\n\n**Mondays**\n\nLooking to try out chess in a welcoming, judgment-free environment? Come to the Saint Louis Chess Club to learn and play with other beginners! Led by our friendly and experienced instructors, Beginners Night offers an engaging and social setting to both learn the rules and practice against other casual players.\n\nFree for members, first visit is free!\n\n[**Big Muddy Adventures – STL Riverfront Adventure**](https://www.2muddy.com/trips)\n\n**Recurring (Check Calendar)**\n\nBig Muddy Adventures was established in 2002. They are the first professional outfitter/guiding company providing access to the wild wonders of the Middle Mississippi and Lower Missouri Rivers.\n\n[**Chess at the Brewery**](https://www.instagram.com/chessatthebrewery/)\n\n**Every Wednesday**\n\nLocal meetup group of chess players that meet at breweries on Wednesday nights. They rotate locations each week. See their Instagram ([https://www.instagram.com/chessatthebrewery/](https://www.instagram.com/chessatthebrewery/)) for the location this week.\n\n[**Ladies Knight at Saint Louis Chess Club**](https://saintlouischessclub.org/event/ladies-knight/)\n\n**Wednesdays**\n\nA class by women, for women! Ladies’ Knight is open to women of all ages and all skill levels. Whether it’s your first time playing chess, or you’re an experienced player looking for a challenge, enjoy engaging with a community of like-minded women who are passionate about the game of chess.\n\n[**Landmarks Downtown Walking Tours**](https://landmarkstours-stl.org/)\n\n**Saturdays**\n\nLandmarks Downtown St. Louis Walking Tours: History, Culture, Architecture, and Exercise: What could be better on a Saturday morning.\n\n# Bar/Food Weekly Events\n\n[**Drag Brunch at Hidden Gem**](https://www.drinkhiddengem.com/pages/events)\n\n**Saturdays**\n\nWhere else would you be on a Saturday?! Drag Brunch is a weekly event at Hidden Gem and FREE to attend. Bring your own brunch, grab a hot dog from the bar, or DoorDash your fave snack.\n\n[**Karaoke Dance Party at Tin Roof**](https://tinroofstlouis.com/calendar/)\n\n**Wednesdays**\n\nGrab your crew and hit The Roof for your chance to own the stage at Karaoke Dance Party! This ain't your mama's karaoke.... It's a PARTY!\n\n[**Karaoke Tuesdays at Hidden Gem**](https://www.drinkhiddengem.com/pages/events)\n\n**Tuesdays**\n\nCome sing your hearts out at Hidden Gem's weekly karaoke. Hosted every Tuesday from 8pm-12am. Free to attend. 21+.\n\n[**Karaoke Wednesdays at HandleBar**](https://do314.com/events/weekly/wed/karaoke-wednesdays-tickets)\n\n**Wednesdays**\n\nBrowse the catalog and find your favorite songs to sing! [Songbookslive.com/stlredcarpet](https://songbookslive.com/stlredcarpet)\n\n[**Karaoke Wednesdays at Mack's Bar &amp; Grill**](https://macksbarandgrill.com/)\n\n**Wednesdays**\n\nBring your best vocals, DJ Brainstorm and Mack's will handle the rest\n\n[**Sunday Bingo at Tim's Chrome Bar**](https://timschromebar.com/calendar-1)\n\n**Every Sunday**\n\nGet in the mood for some fun with an afternoon of BINGO at Tim’s. They'll supply the cards and daubers. Just bring yourself and your BINGO loving friends. Play for some good laughs and a variety prizes. Bar opens at 12 p.m., they'll start BINGO at 3 p.m. Cheers!\n\n[**Sunday Brunch Cruise on Riverboats at the Gateway Arch**](https://tickets.gatewayarch.com/webstore/shop/viewItems.aspx?cg=cat&amp;c=SBC)\n\n**Sundays**\n\nThe perfect Sunday starts with brunch aboard the Riverboats at the Gateway Arch.\n\nDuring the two-hour cruise, you can enjoy spectacular views, live entertainment and chef-inspired cuisine. The floating brunch menu features strawberry pancakes, scrambled eggs, buttermilk biscuits, sausage gravy, cinnamon rolls, fresh fruit, stuffed chicken breast, maple ham, garlic green beans and more.\n\n[**Thirs-Tea Thursday Happy Hour at Tim's Chrome Bar**](https://timschromebar.com/)\n\n**Thursdays**\n\nThirs-Tea? They've got you covered...this is their weekly happy hour for you groovy party people. Grab something refreshing like $3 4Hands Yes Tea, $6 Turn the Beat Around &amp; $6 Tea Collins, and $2 off all food from 5–8:30 p.m. every Thursday!\n\n[**Wayback Wednesdayz at Puttshack**](https://www.puttshack.com/blog/happenings/wayback-wednesdayz)\n\n**Wednesdays**\n\nSt. Louis’s favorite mini golf spot is cranking up the heat at City Foundry. Known for rewriting the rules of traditional mini golf, Puttshack is also rewriting the typical Wednesday, having launched \"Wayback Wednesdayz,\" taking place every Wednesday from 7 pm until closing time. This weekly programming offers guests an opportunity to relive the nostalgia of yesteryears with classic tunes and music videos from the likes of legendary artists such as Missy Elliot and Madonna to Michael Jackson and Prince playing throughout the venue.\n\n# Comedy Clubs / Open Mic\n\n[**Funny Bone Comedy Club**](https://www.stlouisfunnybone.com/)\n\nComedians come to the Funny Bone from all over the country. On Tuesdays at 7:30 PM, local pros and amateurs take the stage to polish their material in front of a live audience.\n\n[**Helium Comedy Club**](https://st-louis.heliumcomedy.com/)\n\nHelium Comedy Club - St. Louis is a contemporary entertainment venue that bring stadium-sized talent to an intimate theater on a weekly basis.\n\n[**Open Mic Comedy Night at Steve’s Hot Dogs – Grand**](https://explorestlouis.com/event/open-mic-comedy-night-3/2025-10-16/)\n\n**Thursdays**\n\nJoin Steve's Hot Dogs every Thursday night for Open Mic Comedy Night on South Grand! Sign up if you're feeling funny - or just come to catch these talented folks before they're too cool to play our stage!\n\n[**The Improv Shop**](https://theimprovshop.com/show-calendar/?tribe_paged=1&amp;tribe_event_display=list&amp;tribe_venues=233)\n\nThe Improv Shop is an improv comedy venue and training center supporting fans, students and performers in St. Louis.\n\n# Farmers Markets\n\n[**Soulard Farmers Market**](http://www.soulardmarket.com/)\n\n**Wednesdays - Saturdays**\n\nSoulard Farmers Market is located at 730 Carroll Street in St. Louis, Missouri, a half mile north of the Anheuser-Busch Brewery. The market is open Wednesday through Saturday, year round. They feature locally grown and shipped in goods, including: produce, meats, cheeses, spices, gourmet kettle corn, flowers, baked goods, and general merchandise. There are also several different eateries that have many food options, which allows customers the convenience to grab a quick bite to eat and a drink while shopping.\n\n[**Tower Grove Farmers Market**](https://tgfarmersmarket.com/)\n\n**Tuesdays &amp; Saturdays**\n\nLocated just west of Center Cross Drive in the heart of Tower Grove park at 4256 Magnolia Ave, St. Louis, MO 63110\n\n# Festivals &amp; Special Events\n\n[**Art Inside Festival at Schlafly Tap Room**](https://www.schlafly.com/events/schlafly-art-inside)\n\n**January 30 - February 1, 2026**\n\nThe second-annual Art Inside Festival will be held Friday, Jan. 30 – Sunday, Feb. 1, at Schlafly Tap Room.\n\nThis free, indoor art fair is a celebration of St. Louis’ vibrant art scene, live music, and community by featuring unique artwork made by local artists and performances all weekend long by local performers.\n\n[**Delmar Loop Ice Carnival**](https://visittheloop.com/events/loop-ice-carnival-2026/)\n\n**January 31, 2026**\n\nOne of St. Louis’ coolest signature events takes place in the Delmar Loop.\n\nThe Loop Ice Carnival will celebrate the season with live ice-carving demonstrations, astounding ice sculptures, impressive fire performers and festive stilt walkers. You can also join the playful scavenger hunt, roast marshmallows for s’mores and have your face painted.\n\nThe signature event will end with a mesmerizing drone show, adding a futuristic touch to the winter celebration.\n\n[**Orchid Show at Missouri Botanical Garden**](https://www.missouribotanicalgarden.org/events-classes/signature-events/orchid-show)\n\n**January 31 - March 1, 2026**\n\nOn display at the ever-popular orchid show, the Missouri Botanical Garden’s vast orchid collection includes more than 6,000 individual plants representing almost 700 unique species, and approximately one in 10 orchids in the collection is threatened or endangered. Different species bloom at different times, so the orchid show is constantly changing – and always exciting!\n\n[**STL RV Travel Show at America's Center &amp; The Dome**](https://stlrv.com/)\n\n**January 30 - February 1, 2026**\n\nIn its 48th year, STL RV Travel Show is the GO-TO place to shop for a new 2026 RV, trade up to your dream RV, or just learn about the joys of traveling RV-style.\n\n# Live Music\n\n[**Grateful Mondays at Schlafly Tap Room**](https://www.schlafly.com/events/grateful-mondays)\n\n**Mondays**\n\nStart the week on the right note! On Monday nights, Schlafly Tap Room in downtown St. Louis hosts acoustic Dead jams featuring Nick Elwood and Tracy Gladden of The Stone Sugar Shakedown as well as a rotating cast of St. Louis’ most talented acoustic guitarists.\n\n[**Mondays at The Music Stand in Tower Grove Park**](https://www.towergrovepark.org/mondays-at-the-music-stand)\n\n**Mondays**\n\nThe Music Stand has long been a cherished gathering place where melodies meet memories, and we are thrilled to welcome back the tradition of free community concerts. Bring your family and friends, and let the music uplift your spirit and foster a sense of community, as we celebrate the universal language of music together.\n\n[**Open Mic Night at Schlafly Bottleworks (Maplewood)**](https://www.schlafly.com/event-directory/)\n\n**Every Wednesday**\n\nJoin others every Wednesday evening and showcase your talents with our Open Mic Night! Open sign up begins at 6:30PM with music starting at 7:00PM. They welcome original material, covers and spoken word! Grab a beer, then play and listen every Wednesday! There are no cover charges and no drink minimums to attend.\n\n[**The Wizard of Oz in Concert at Powell Symphony Hall**](https://shop.slso.org/8809)\n\n**January 30 - February 1, 2026**\n\nThe timeless 1939 film classic The Wizard of Oz returns to the big screen with the SLSO performing Herbert Stothart’s iconic score live.\n\n|*Music Venues*|*Bars with Live Music*|\n|:-|:-|\n|[Blanche M. Touhill Performing Arts Center](https://www.umsl.edu/touhill/live/index.html)|[1860 Saloon](https://1860saloon.com/events-music/)|\n|[Blueberry Hill Duck Room](https://www.thepageant.com/?_sfm_venue=21911)|[BB's Jazz, Blues &amp; Soups](http://bbsjazzbluessoups.com/music.htm)|\n|[Chesterfield Amphitheater](https://www.chesterfieldamphitheater.com/events.html)|[Broadway Oyster Bar](http://www.broadwayoysterbar.com/musicsched.html)|\n|[Delmar Hall](https://www.thepageant.com/?_sfm_venue=233)|[City Foundry](https://www.cityfoundrystl.com/news/saturday-live-music-the-food-hall)|\n|[Enterprise Center](http://www.enterprisecenter.com/events)|[Gallery Pub](http://gallerypubstl.com/calendar/)|\n|[The Fabulous Fox Theatre](https://www.fabulousfox.com/events)|[Gaslight Lounge](https://www.gaslightstl.com/)|\n|[The Factory](https://www.livenation.com/venue/KovZpZAEAnaA/hollywood-casino-amphitheatre-st-louis-mo-events)|[The Heavy Anchor](https://www.theheavyanchor.com/#QyOBie)|\n|[Hollywood Casino Amphitheatre](https://www.livenation.com/venue/KovZpZAEAnaA/hollywood-casino-amphitheatre-st-louis-mo-events)|[The Honky Tonk STL](https://www.thehonkytonkstl.com/live-music)|\n|[J. Scheidegger Center for the Arts](https://www.lindenwood.edu/j-scheidegger-center-for-the-arts/upcoming-events/)|[Jazz St. Louis](https://my.jazzstl.org/events?view=calendar&amp;startDate=2021-09-01)|\n|[Off Broadway](https://www.offbroadwaystl.com/calendar/)|[Joe's Cafe](https://do314.com/venues/joe-s-cafe-gallery)|\n|[Old Rock House](http://oldrockhouse.com/concert-calendar/)|[The Lot on the Landing](https://www.jamopresents.com/THELOT/#EVENTS)|\n|[The Pageant](https://www.thepageant.com/?_sfm_venue=232)|[Tim's Chrome Bar](https://timschromebar.com/calendar-1)|\n|[Red Flag](https://redflagstl.com/events/)|[McGurk's](https://www.mcgurks.com/live-music/)|\n|[The Sheldon](https://www.thesheldon.org/events/)|[Rigazzi's](https://explorestlouis.com/event/live-music-at-rigazzis/2025-05-18/) (Wednesdays &amp; Sundays)|\n|[St. Louis Music Park](https://www.centenecommunityicecenter.com/events/venue/saint-louis-music-park)|[SoFar St. Louis](https://www.sofarsounds.com/st-louis) *Secret performances around town*|\n|[St. Louis Symphony Concert Calendar](https://www.slso.org/en/tickets/performance-listing/)|[Venice Cafe](http://www.thevenicecafe.com/)|\n|[Stifel Theatre](http://www.stifeltheatre.com/events)|[Yaquis on Cherokee](https://www.facebook.com/YaquisOnCherokee/events/)|\n\n# Museums &amp; Exhibits\n\n[**Free Fridays at Saint Louis Art Museum**](https://www.slam.org/events/)\n\n**Fridays**\n\nOn Fridays, ticketed exhibitions are free and the Museum is open late, with the last entry into the exhibition at 8 pm.\n\n[**The Many Faces of Mardi Gras at Third Degree Glass Factory**](https://eventvesta.com/events/124179-the-many-faces-of-mardi-gras)\n\n**January 6 - February 27, 2026**\n\nGlass and metal artists Teri Walker and Chad Ridgeway are bringing the magic of New Orleans to Third Degree Glass for a two-month exhibition titled, The Many Faces of Mardi Gras. The show highlights some of the couple's favorite aspects of carnival season.\n\n**Museums Around Town:**\n\n[**Contemporary Art Museum St. Louis**](https://camstl.org/)\n\nThe Contemporary Art Museum St. Louis (CAM) is one of the preeminent non-collecting institutions of contemporary art in the U.S. Its mission is to create meaningful engagement with the most relevant and innovative art being made today. Here, you’ll find a site for discovery, a welcoming space, and it’s free for all.\n\n[**Missouri History Museum**](https://mohistory.org/society)\n\nOne of the most visited history museums in the nation, the Missouri History Museum looks at the history of the St. Louis region from the Mississippian people up to the present day.\n\n[**National Blues Museum**](https://www.nationalbluesmuseum.org/)\n\nAt the National Blues Museum, we dive into the Blues, the foundation of all modern American music. We're about learning with a beat, mixing fun with interactive features and exhibits full of unforgettable artifacts. Our public events give this place its rhythm. We're more than a museum - Blues Lives Here.\n\n[**Soldiers Memorial Military Museum**](https://mohistory.org/memorial/visit-soldiers-memorial/)\n\nSoldiers Memorial Military Museum is a state-of-the-art museum facility in downtown St. Louis that honors military service, veterans and their families. Soldiers Memorial shares American military history through the lens of St. Louis. Following a multi-million dollar revitalization, this St. Louis landmark reopened on November 3, 2018 under the operational leadership of the Missouri Historical Society.\n\n[**St. Louis Art Museum**](https://www.slam.org/events/)\n\nDedicated to Art and Free to All. Located in beautiful, historic Forest Park, the Saint Louis Art Museum hosts a world-class and varied collection of original works of art and artifacts, spanning five millennia and six continents, in one of the most impressive buildings in the city. Admission to the Museum is free every day, and admission to special exhibitions is free on Fridays.\n\n[**St. Louis Science Center**](https://www.slsc.org/)\n\nWith the mission \"to ignite and sustain lifelong science and technology learning\", the Saint Louis Science Center is one of the top five science centers in the United States.\n\nThe complex includes over 96,000 sq-ft of interactive science-technology exhibits that are part of the Science Center's free general admission.\n\n# Theater &amp; Performing Arts\n\n**\\*\\*** [**Click here**](https://explorestlouis.com/see-and-do/arts-and-culture/theater-and-performing-arts/) to see theaters around town.\n\n[**Hell’s Kitchen at The Fabulous Fox Theatre**](https://www.fabulousfox.com/events/detail/hells-kitchen)\n\n**January 27 - February 8, 2026**\n\nHell’s Kitchen – the award-winning Broadway musical created and inspired by 17-time Grammy Award-winning Alicia Keys – takes you on a journey with Ali, a 17-year-old girl full of fire.\n\nRelatable, raw and refreshingly fun, it’s a celebration of finding yourself, your purpose and the people who lift you up.\n\nThe music – a mix of Keys’ greatest hits and new songs written exclusively for the show – tells a tale that speaks to you no matter where you’re from, where you’ve been or where you’re going.\n\n[**Misterioso at City Museum**](https://circusharmony.ludus.com/index.php?show_id=200498084)\n\n**Saturdays &amp; Sundays in February**\n\nIn music, the word ‘misterioso\" is an Italian term that means to play in a mysterious way, creating a feeling of intrigue. This story of somersaulting sleuths solving a wild whodunit is directed by Artist-In-Residence and guest director, Susan Voyticky, a celebrated circus artist, choreographer, and director known for her dynamic performances and innovative creations, and features Circus Harmony's fabulous flying children.\n\nMisterioso is Circus Harmony's annual, full-length show performing at 2pm every Saturday and Sunday in February at our home ring in City Museum.\n\n# Sporting Events This Week\n\n[**Family Night with Fredbird**](https://www.mlb.com/cardinals/cardinals-nation/restaurant-and-bar/family-night)\n\n**Wednesdays**\n\nJoin others at Cardinals Nation Restaurant &amp; Bar for Family Night with Fredbird on select Wednesday evenings this off-season! Bring your family down for games, prizes, and meet Fredbird from 6:30-7:30pm.\n\n[**St. Louis CITY SC Street Party at Schafly Tap Room**](https://www.schlafly.com/events/louligan-street-party)\n\n**Every Home Game (Check Schedule)**\n\nIn celebration of all CITY SC home soccer games, we close down Louligan Street and support our St. Louis team the only way we know how: great food, drinks, and fun. There are beer/food tents, a draft van, food trucks, and more.\n\n**Local Team Schedules:**\n\n[**St. Louis Cardinals schedule**](https://www.mlb.com/cardinals/schedule/)\n\n[**St. Louis Blues schedule**](https://www.nhl.com/blues/schedule)\n\n[**St. Louis City SC schedule**](https://www.stlcitysc.com/schedule)\n\n[**St. Louis Battlehawks schedule**](https://www.theufl.com/teams/st-louis/schedule)\n\n[**St. Louis Billikens schedule**](https://slubillikens.com/sports/mens-basketball)\n\n# Trivia Nights\n\n|Location|Date/Time|More Information|\n|:-|:-|:-|\n|[Crack Fox](https://www.thecrackfox.com/)|**Mondays 6:00 pm - 10:00 pm**|They host a weekly free tournament and game night. Emphasis on Non Alcoholic refreshments and camaraderie.|\n|[Joey B's on the Hill](https://www.joeybshill.com/)|**Mondays 8:30 pm - 10:30 pm**|[Trivia Details](https://do314.com/events/weekly/mon/trivia-guy-stl-monday-night-trivia)|\n|[Nick's Pub](https://www.nicksirishpub.com/)|**Mondays**||\n|[Urban Chestnut (The Grove)](https://www.urbanchestnut.com/events)|**Mondays 7:00 pm - 9:30 pm**||\n||||\n|Blueberry Hill|**Tuesdays at 7:00pm**|Trivia nights in the Dart Room. [Trivia Details](https://www.facebook.com/p/Missouri-Trivia-League-100092170994810/)|\n|[Felix's Pizza Pub](https://www.felixspizzapub.com/)|**Tuesdays at 8:00 pm**|[Trivia Details](https://do314.com/events/weekly/tue/tenacious-trivia-fpwzzmrc)|\n|ITAP (Soulard)|**Tuesdays at 7:00 pm**||\n|[Schlafly Brewpubs (Any Location)](https://www.schlafly.com/events-calendar/)|**Tuesdays 7:00 pm - 9:00 pm**|[Trivia Details](https://do314.com/events/weekly/tue/tuesday-trivia-at-schlafly-tickets)|\n|[Rockwell Beer Co](https://www.rockwellbeer.com/)|**Tuesdays**|[Trivia Details](https://www.rockwellbeer.com/upcoming-events/trivia-tuedays) (Reservations required)|\n|[The Mack](http://mackbarandgrill.com/)|**Tuesdays at 8:00 pm**|[Trivia Details](https://do314.com/events/weekly/tue/tuesday-night-trivia-mxjupeuk)|\n|[Steve's Hot Dogs](https://www.steveshotdogsstl.com/)|**Tuesdays 7:30 pm - 9:30 pm**|[Trivia Details](https://www.steveshotdogsstl.com/event-details/trivia-night-every-tuesday-at-steves-hot-dogs-2022-08-09-19-30)|\n||||\n|[Anheuser-Busch Biergarten](https://www.budweisertours.com/stlbiergarten)|**Wednesdays 5:30 pm - 7:30 pm**|During the events, players can enjoy drink specials, including $3 aluminum cans, $13 pitchers and $20 NUTRL buckets. We’ll cheers to that!|\n|[Hidden Gem](https://www.drinkhiddengem.com/)|**Wednesdays**||\n|ITAP (Delmar Loop)|**Wednesdays at 7:00 pm**||\n|[Pieces Board Game Bar &amp; Cafe](https://www.stlpieces.com/)|**Wednesdays**|[Trivia Details](https://www.geekswhodrink.com/venues/599510345/)|\n|[The Post](https://thepostsportsbar.com/)|**Wednesdays 8:00 pm - 10:00 pm**|[Trivia Details](https://thepostsportsbar.com/trivia/)|\n||||\n|[City Foundry](https://www.cityfoundrystl.com/)|**Thursdays 7:00 pm - 9:00 pm**||\n|[City Park Grille](https://www.city-park-grill.com/)|**Thursdays at 8:00 pm**|[Trivia Details](https://www.geekswhodrink.com/venues/1314869233/)|\n|[The Pat Connolly Tavern](https://www.patconnollytavern.com/)|**Thursdays at 7:30 pm**||\n|[HandleBar](http://handlebarstl.com/)|**Thursdays at 7:00 pm - 9:00 pm**|[Trivia Details](https://do314.com/events/weekly/thu/trivia-tickets)|\n|[Urban Chestnut (Midtown)](https://www.urbanchestnut.com/)|**Thursdays at 7:00 pm**|[Trivia Details](https://www.urbanchestnut.com/events)|\n|[Wellspent Brewing](https://www.wellspentbeer.com/)|**Thursdays at 7:00 pm**||\n\n# Attractions Around Town\n\n[**Anheuser-Busch Brewery**](https://www.budweisertours.com/stl)\n\nExplore the campus, visit the Clydesdales, and even taste beer straight from the finishing cellars. Choose from a variety of experiences, customized to fit your interests and timeframe.\n\n[**Cahokia Mounds State Historic Park**](https://cahokiamounds.org/)\n\nA sophisticated Native American society of about 20,000 people that operated via a sun calendar and disappeared by 1400.\n\n[**Cathedral Basilica**](https://cathedralstl.org)\n\nThe Mother Church of the Archdiocese of Saint Louis, the superstructure of the Cathedral was built between 1907 and 1914. It is known for its' beautiful interior mosaics, which took nearly 80 years to create using more than 41 million pieces of glass tesserae.\n\n[**Central Public Library**](https://www.tripadvisor.com/Attraction_Review-g44881-d559014-Reviews-Central_Public_Library-Saint_Louis_Missouri.html)\n\nBuilt in 1912, the St. Louis Public Library's flagship, Central Library, is a monument to the past and a cultural beacon for the future. Spanning an entire city block just west of the Convention Center, Central Library is one of St. Louis' grandest works of art.\n\n[**City Museum**](https://citymuseum.org/)\n\nDon't take the name so literally. They're about fun. Not your white walls, walk around, and be quiet museum. If you want to climb around, get active with your kids or are a big kid at heart, they're the place.\n\n[**Forest Park**](https://www.forestparkforever.org)\n\nThe site of the 1904 World's Fair, America's second largest urban park is a prime St. Louis recreation spot.\n\n[**Gateway Arch**](https://www.gatewayarch.com)\n\nFrom the thrilling views to the amazing stories, a visit to the Gateway Arch is an experience that never fails to inspire.\n\n[**Grant's Farm**](https://grantsfarm.com/)\n\nA visit to Grant’s Farm begins with a tram ride through Deer Park, where you can see a variety of our bovine and other four-legged friends. Then, you’ll be dropped off at the Tier Garten where you can enjoy the petting zoo area – featuring the famous baby goat bottle-feeding – carousel rides, food and vending in the Bauernhof Courtyard, and of course, free beer tasting.\n\n[**Missouri Botanical Garden**](https://www.missouribotanicalgarden.org/)\n\nThe Missouri Botanical Garden in St. Louis was founded in 1859 by Henry Shaw. Today, the Garden is a National Historic Landmark and a center for science, conservation, education and horticultural display - widely considered one of the top three botanical gardens in the world.\n\n[**Old Courthouse**](https://www.archpark.org/visit/points-of-interest/old-courthouse)\n\nThe Old Courthouse in Downtown St. Louis, part of Gateway Arch National Park, was built between 1839 and 1862. Some of the most pivotal court cases in American history were heard inside its courtrooms. It is where Dred and Harriet Scott sued for freedom, Virginia Minor fought for her right as a woman to vote, and more than 300 enslaved African Americans filed suit for their freedom.\n\n[**St. Louis Union Station**](https://www.stlouisunionstation.com/)\n\nSt. Louis Union Station combines historic elegance with modern and stunning detail. Union Station is and will be a future top tier family friendly destination boasting a one of a kind aquarium, a 200 foot Ferris wheel and many other unforgettable family attractions.\n\n[**St. Louis Zoo**](https://stlzoo.org/)\n\nVisitors are wowed by this zoo that has 6,600 animals and 15 major exhibit areas.\n\n[**Tower Grove Park**](https://www.towergrovepark.org/)\n\nOfficially opened to the public in 1872, Tower Grove has been characterized as the largest and best preserved 19th-century Gardenesque style city park in the United States. This formal landscape architecture style features winding paths, symmetrical features, intense planting and the use of architecturally elaborate gates, pavilions, and houses\n\n[**World Chess Hall of Fame**](https://worldchesshof.org/)\n\nThe World Chess Hall of Fame (WCHOF) celebrates one of the world’s oldest and best-loved games through vibrant, engaging exhibitions and creative programming. A not-for-profit, collecting institution situated in the heart of Saint Louis, the WCHOF houses both the US and World Chess Halls of Fame, which honor the accomplishments of the game’s finest players.",
    "author": "STLhistoryBuff",
    "date": "2026-01-26T19:32:50",
    "url": "https://www.reddit.com/r/StLouis/comments/1qngunc/things_to_do_events_this_week_12626_2126/"
  },
  {
    "platform": "Reddit",
    "content": "**SATURDAY 28 MARCH**\n\n*Welcome at 9 am, everyone to be seated by 9.10 am.* \n\n🌾 **SESSION 1: Fandom &amp; Fiction**  \n • **Ian Merry** — *Ambridge: Life on the Streets*  \n • **Jerome Turner** — *Ambridge Extra: Radio experiment or fever dream?*  \n • **Karen Rodham** — *An exploration of listeners’ Pavlovian responses to Barwick Green*  \n • **Sarah Buckle** — *The Archers Brand*  \n • **Alexander Lewis-Jones** — *EV Charging*\n\n🎭 **SESSION 2: Characters and Characterisations**  \n • **Sarah Spilsbury** — *Vince &amp; Birmingham*  \n • **Fiona Gillison** — *It can’t only be Rosie: Why The Archers Should Talk More About Body Weight*  \n • **Vivian Colbert** — *Voices, Silences, and Queer Lives: Performing Identity in The Archers*  \n • **Nicola Maxfield** — *Grand Designs, Modest Foundations: Desperately Seeking Betterment*\n\n🎙️ **INSIDE THE STORY – Two Very Important Ambridge Guests**  \n • **Keri Davies** (Scriptwriter) and **one guest TBA**  \n In conversation with **Dr Cara Courage**  \n *(Our second VIP guest will be announced in the coming weeks – we assure you, you will not want to miss this)*\n\n👠 **ONE STILLETTO IN THE GRAVE – LIVE PODCAST RECORDING**  \n • **Jane James** and **Sunny Ormonde** (aka *Lillian Bellamy*)  \n With two special Ambridge guests (to be announced closer to the conference)\n\n🌱 **SESSION 3: Conversation and Community**  \n • **Pauline Bucknell** — *‘I had this friend who…’ Exploring the Purpose and Incidence of Anecdotes in The Archers*  \n • **James Tuit &amp; Aditi Krishnakumar** — *Ambridge Community Structure*\n\n🏛️ **SESSION 4: Interests and Institutions**  \n • **Jonathan Hustler** — *The Churchmanship of St Stephen’s*  \n • **Bev Milner Simonds** — *The Ambridge Fete – analysis from behind the gazebo…*  \n • **Meg Burton** — *Cricket Teas*\n\n🎧 **TALKING THE ARCHERS**  \n • **Keri Davies**\n\n🏆 **Academic Archers Awards Ceremony**\n\n🍽️ **Conference Dinner** \\- **with Brian Hewlett, aka Neil Carter, as VIP After Dinner Speaker** \n\n \n\n**SUNDAY 29 MARCH**\n\n*Everyone to be seated for 9.15 am*\n\n🌍 **SESSION 5: Ecology and Economy**  \n • **Claire Astbury** — *Net Zero Ambridge: Decarbonisation Starts At Home*  \n • **Matt Underwood** — *Ultimate arboriculture: quantifying the value of trees in Ambridge*\n\n📖 **SESSION 6: Literature and Landscape**  \n • **Christine Narramore** — *Ambridge, Fact and Fiction*  \n • **Helen Burrows** — *‘This Blessed Plot, This Earth, This Realm, This Ambridge?’*\n\n🎧 **LIVE LISTEN**  \n A shared listening experience — always one of the most loved moments of the weekend.\n\n🌾 **Closing Reflections, Thanks &amp; Next Steps** \n\n# Stay With Us – Exclusive On-Campus Deal book here: [**https://bandb.warwick.ac.uk/**](https://bandb.warwick.ac.uk/)\n\nWe've secured an accommodation offer at **Radcliffe**, right on the University of Warwick campus:\n\n* **£90 per night** for single occupancy (incl. VAT &amp; breakfast)\n* **£120 per night** for double/twin occupancy (incl. VAT &amp; breakfast)\n\nAvailable for **Friday 27** and **Saturday 28 March 2026**  \n**Promo Code:** **AABB26**\n\n**Note:** When booking, select ‘1 person’ even if you choose a double/twin room – it will still be charged at the single occupancy rate of £90.",
    "author": "wakingkraken",
    "date": "2026-01-26T19:21:22",
    "url": "https://www.reddit.com/r/Ambridge/comments/1qngk17/academic_archers_conference_news_the_schedule_for/"
  },
  {
    "platform": "Reddit",
    "content": "**Hello and Welcome to my wall of text :)** (fairly direct wall of text that is)\n\nI'm 22, Introverted, Conservative and Australian **(Please Be 20/21+)**\n\nJust to shorten it a little, all the information about me is pinned to my profile so please check that out before contacting me.\n\n---\n\nMy Timezone is **AEDT/AEST** although I don't mind playing with other Timezones/Regions, Ping doesn't bother me too much and I'm also open to Cross-play \n\n\n**[My Favourite Game Genre's]**\n- Realistic Shooters\n- Grand Strategy/RTS \n- Base Building &amp; Survival \n- Flight &amp; Racing/Rally Sims\n- Story Driven RPG's &amp; RPG's overall \n\n**[System/s I Own]**\n- PC \n- XBOX SERIES X &amp; 360\n- PS3 &amp; 4 (Haven't renewed PS+)\n\n---\n\n\n**[Games I Play]**\n\nThis is not my entire library of games I own, it's just the ones I frequent the most (almost all of the games listed below are multiplayer but there are some singleplayers sprinkled in there as well) \n\n**[XBOX]**\n- Space Marine 2 \n- Battlefield 1, 4, 5 &amp; 6\n- Red Dead Redemption 2\n- Darktide \n- Battlefront 2\n- Halo MCC \n\n**[PC]**\n- Chivalry 2 \n- Space Marine 2 \n- Battlefield 1, 4 &amp; 5 \n- Sons Of The Forest\n- The Forest \n- Arc Raiders \n- Metro Trilogy (2033, Last Light &amp; Exodus)\n- Mass Effect Trilogy (1,2 &amp; 3)\n- Dragon Age Trilogy (Origins, 2 &amp; Inquisition) \n- Kingdom Come Deliverance 1 &amp; 2\n- Ghost Recon Wildlands \n- Hell Let Loose\n- Sniper Elite 4 &amp; 5 \n- Star Citizen \n- Elite Dangerous \n- X4 Foundations\n- Holdfast: Nations at War\n- Darktide \n- Green Hell \n- Tarkov\n- Rust\n- Repo\n- Zero Hour\n- Total War: Warhammer 1 &amp; 3\n- Mount &amp; Blade: Bannerlord &amp; Warband \n- Crusader Kings 2 &amp; 3\n- Ready or Not \n- Insurgency Sandstorm \n- Halo MCC\n- Helldivers 2 \n- Phasmophobia \n- Assetto Corsa\n- Forza Horizon 4 &amp; 5 \n- Arma 3\n- Arma Reforger \n- Arma Cold War Assault \n- War Thunder \n- Enlisted \n- Vermintide 2\n\n---\n\n**[Games I Don't Play]**\n\nit's perfectly fine if you enjoy them, They're Just not **My** kind of Games and **I** have No interest in playing them, Simply personal preference. (This is your answer to \"Why not?\") \n\n- Fortnite \n- Valorant \n- Minecraft \n- Stardew Valley \n- The Finals\n- Terraria \n- Peak\n- Overwatch \n- Apex Legends \n- Wuthering Waves\n- Roblox \n- League Of Legends\n- Genshin Impact \n- Marvel Rivals\n- Anime Games and Hero Shooters \n\n---\n\nFeel free to shoot me a Direct Message (DM) if you're interested in Gaming sometime.\n\n**God Wills It**\n",
    "author": "Heavy_Artillery47",
    "date": "2026-01-26T19:11:13",
    "url": "https://www.reddit.com/r/GamerPals/comments/1qngb7k/22pcxbox_searching_for_someone_genuine_and/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.\n\n[](https://www.reddit.com/submit/?source_id=t3_1qnflnh)",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:58:58",
    "url": "https://www.reddit.com/r/stockstobuytoday/comments/1qng0rw/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.\n\n[](https://www.reddit.com/submit/?source_id=t3_1qnflnh)",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:58:22",
    "url": "https://www.reddit.com/r/smallstreetbets/comments/1qng091/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:57:36",
    "url": "https://www.reddit.com/r/Pennystock/comments/1qnfzok/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "在我心里，不知道桫椤是作什么买卖的！我以前就怀疑过，暗地里问，有的市政监理说：他就是个精明的生意人。也有人说，加拿大的建筑业就是他们意大利人的，你们Davroc测试实验室可不好惹，说什么的都有。\n\n一件件奇怪的事不断地发生。那时，我认为自己卷入了资本家的行业内恶性竞争。敌对方是一伙儿叫“大佛印（Dufferin）” 的坏人和刘健君。大佛印是北约克（North York）的一群臭名昭著的坏小子，背后有一些财团支持。而刘健君即利用Davroc也利用大佛印，背后捣乱，就是 “琢磨” 我。 “琢磨” 我这件事源于4.5节的《真人医学实验的报纸新闻》，她继承了她爸爸的灵魂转世实验的事业。\n\n从上面破坏路面的事之后，不到两周时间，我就处于恐惧，怀疑，全身昏沉的感觉（注1），已经处于天昏地暗，昼夜难辨的状态（注1）。我认为自己只是个打工的，挣点儿工资养家糊口，不应该卷进他们的大买卖，整不好，不一定什么时候被驱逐出建筑行业或被送进监狱。我从Davroc辞职了。\n\n注1，这些描述实际是长时间处于高度恐惧、迷惑、和怀疑引起的不舒适的感觉。\n\nIn my heart, I don't know what Sal Fasullo does! I had doubted it before, and asked secretly, and some municipal supervisors said that he was a shrewd businessman. Some people also say that Canada's construction industry is their Italian, and your Davroc testing laboratory is not easy to mess with, many kinds of saying.\n\nStrange affairs kept happening. At that time, I thought that I was involved in vicious competition in the capitalist industries. The components are Dufferin Gang and Eve Liu. Dufferin Gang is a group of notorious bad boys in North York with some consortium behind them. And Eve Liu used both Davroc and Dufferin to make me trouble, that is to “polish” me. The “polishing” of me stemmed from section 4.5, “Newspaper News of Real Human Medical Experiments”, in which she inherited her father's career of soul reincarnation experiment.\n\nIn less than two weeks after the “Job Rip” above, I was in a state of highly fearful doubtful and drowsiness, was already in a state of indistinguishable day and night (note 1). I thought I'm just a regular worker, earning a little salary to support family, shouldn't be involved in their big deals，not necessary to take the risk of being expelled from construction industry or sent to prison. I resigned from Davroc.\n\nNote 1, these descriptions are uncomfortable feelings caused by prolonged periods of highly fear doubt and muddle.\n\nhttps://preview.redd.it/qb5e7zzy1pfg1.jpg?width=2153&amp;format=pjpg&amp;auto=webp&amp;s=f30c9542d8805ece7b29e01b499bf5dc80e7f042\n\n2\n\n二零一零年五月，我在Mississauga买了房子，在家休息，栽树，看圣经。我觉着自己干不了工程师的工作了。\n\nIn May 2010, I bought a house in Mississauga and spent my time at home resting, planting trees, and reading the Bible. I felt that I could no longer work as an engineer.\n\n3\n\n七月，我到LVM Ltd做土建技术员。开始两个月还好，也是怀疑这怀疑那的。十月，它们派我去负责安省北部的一座小型飞机场翻修项目。这个项目对我来说，有些难度，技术上不熟。机场是二次世界大战时修的，下面根本没有地基，这个社区又没钱。奇怪的事又发生了，测量的数据和实验室的数据相差太大，而且测量数据也离散，离散到了我根本没办法理解。我怀疑是刘健君在背后更改了实验的数据。我建议使用从现场用标准的程序作出材料的标准密度，在辅助用现场的观察来决定施工质量是否合格。LVM和建筑公司都同意了，我自己却没有任何可参考的实验室数据，而且这是飞机场建设。\n\n几周后，我的身心又处于天昏地暗之中了。在我打电话的时候，常有电话窜线，有人在我们通话时，他们在开会，唠嗑，以这种形式指导我，或者向我传递信息。\n\nIn July, I went to LVM Ltd as a civil technician. The first two months were fine, but I also doubted this and that. In October, they sent me to lead a small airport renovation project in northern Ontario. This project was a bit difficult and technically unfamiliar to me. The airfield was built during World War II, there is no foundation underneath, and the municipality has no money. Strange thing happened again. The measured data was very different from the laboratory data, and the measured data was also discrete. It was so discrete that I couldn't understand it at all. I suspect that Eve Liu changed the experimental data behind. I suggest using standard procedures to determine the standard density of materials from the site and then using on-site observations to determine whether the construction quality is qualified. Both LVM and the construction company agreed, but I didn't have any laboratory data to refer to, and this was airport construction.\n\nA few weeks later, my body and mind were in darkness again. When I'm on the phone, there are often lines on the phone, and while we're talking, they're in a meeting, chatting, instructing me in this way, or passing on information to me.\n\n4\n\n二零一零年十一月，我收到了卡尔加里环球测试有限公司（Global Testing Ltd）的工作的邀请，做实验室的经理。我接受了这份工作，逃离了这个翻新飞机场的鬼地方。\n\n不知从什么时候开始的，我的胃肠就走动不顺，有很多瘴气，我总是多喝水来通顺胃肠（注4）。皮肤上也生了些疮，治不好。\n\n注4，精神病是情感创伤，胃肠是最能体现情感的器官；不准确地说，胃肠溃疡和那些皮肤病都是心理疾病的伴生病。\n\n在卡尔加里，我对公司老板的一些非规范作法非常有意见。我还被常派去工地。冬天施工的弊病很多，他们为了挣钱，坚持要施工，我对此有很多抱怨。没过多久，我的世界里，刘健君的人跟我到了卡尔加里，继续和我作对。一月末，我回家过年，就没回去卡尔加里。\n\nIn November 2010, I received a job offer from Global Testing Ltd in Calgary as a laboratory manager. I took the job，escaped the hell of Airport Renovation Site.\n\nI don't know when my stomach and intestines didn't move smoothly, there was a lot of miasmas, and I always drank more water to smooth my stomach and intestines. There are also some sores on my skins, which cannot be cured (note 4).\n\nNote 4, Psychosis is emotional trauma, the gastrointestinal tract is the organ that best embodies emotions; it is not accurate to say that gastrointestinal ulcers and those skin diseases are companion diseases of mental illness.\n\nIn Calgary, I'm very vocal about some of the non-standard practices of company owners. I was also often sent to construction sites. There are many drawbacks of winter construction, I complained a lot about those, but they insist on construction to earn money. Soon in my world, Eve Liu's people followed me to Calgary and continued to fight against me. At the end of January, I came home for the New Year and didn't go back to Calgary.\n\n5\n\n二零一一年三月，我到多伦多的建材测试有限公司（Construction Testing Ltd）工作；几周以后被解雇了，因为我时常呆在那里几十分钟，头脑中空无一物（注5）。\n\n注5，这是抑郁的症状。精神病患者在不同的阶段会经历大部分精神病症状。\n\nIn March 2011, I went to work for Construction Testing Ltd in Toronto. I was fired a few weeks later because I often stay there for dozens of minutes with nothing in my head (note 5).\n\nNote 5, this is a symptom of depression. Psychotic patients experience most psychotic symptoms at different stages.\n\n返回成熟期的目录 Return to Catalog of Maturity\n\n",
    "author": "AdamLuyan",
    "date": "2026-01-26T18:47:02",
    "url": "https://www.reddit.com/r/LifeTree/comments/1qnfr4z/89_觉思失调_schizophrenia/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:40:26",
    "url": "https://www.reddit.com/r/trakstocks/comments/1qnflnh/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:39:47",
    "url": "https://www.reddit.com/r/wallstreet/comments/1qnfl58/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "KELOWNA, BC, Jan. 21, 2026 /PRNewswire/ -- **Doseology Sciences Inc.** . **(CSE: MOOD, PINK: DOSEF, FSE: VU70)** (\"Doseology\" or the \"Company\") a leader in biotechnology-driven consumer products, today announced the initiation of a pilot production run of non-nicotine, caffeine-based energy pouches under its wholly owned Feed That Brain® brand.\n\nDoseology's acquisition of Feed That Brain was a strategic decision rooted in alignment with a consumer demographic the Company views as increasingly influential in shaping the future of the oral stimulant category. The brand was built for modern, performance-minded consumers who value intention, control, and thoughtful design in the products they use — characteristics that align closely with Doseology's vision for next-generation stimulation.\n\nUnder Doseology's ownership, Feed That Brain now serves as a platform brand within the Company's broader oral stimulant strategy, supporting disciplined evaluation of new delivery formats that emphasize measured, predictable energy rather than excess or intensity.\n\nThe pilot represents an early step in Doseology's strategy to expand its oral stimulant product portfolio and evaluate pouch-based delivery formats within a controlled, data-driven framework. The products included in the pilot contain no nicotine and are designed to deliver measured caffeine-based energy, with an emphasis on predictability, consistency, and user control.\n\n**Strategic Pilot for Product and Market Validation**\n\nFeed That Brain was originally recognized for its functional gummies and nootropic formulations. Through its integration into Doseology's platform, the brand is now being evaluated as part of a broader initiative to explore non-nicotine oral stimulant formats aligned with evolving consumer preferences.\n\nThe pilot program is intended to support product testing, consumer feedback, and operational learning. The focus is on controlled delivery — emphasizing consistency and predictability in how energy is accessed, rather than intensity or rapid stimulation. Insights from the pilot are expected to inform future formulation, delivery design, and commercialization decisions.\n\n\"This pilot reflects a disciplined and intentional approach to evaluating new product formats within our platform,\" said Tim Corkum, President &amp; COO of Doseology. \"Feed That Brain brings a strong foundation in functional product design, and this initiative allows us to assess caffeine-based, pouch-format energy delivery under a measured and compliant framework.\"\n\n**Delivery Format Considerations**\n\nUnlike traditional energy beverages, pouch-based formats offer a non-liquid, portion-based, unitized approach to caffeine delivery that does not rely on sugar, carbonation, or large-volume consumption. Pouches are designed for controlled, unitized use, allowing consumers to better manage timing and intake in a discreet and portable format.\n\nDoseology's pilot is intended to evaluate how these delivery characteristics influence user experience and behavior in a caffeine-based oral format, rather than to compare performance outcomes versus other energy products.\n\n**Positioning Within a Global Energy-Focused Category**\n\nThe global market for energy-focused consumer products continues to expand across multiple formats. According to Grand View Research, the global energy drinks market — a leading segment within the broader energy category — was estimated at approximately USD $79.4 billion in 2024 and is projected to exceed USD $125 billion by 2030, reflecting sustained consumer demand for energy-oriented products.\n\nAt the same time, consumer and regulatory scrutiny around sugar content, portion size, and excess consumption has contributed to growing interest in alternative formats for caffeine intake. As energy drinks face scrutiny for sugar and excess, smaller companies are increasingly testing alternative ways people consume caffeine — with an emphasis on control rather than intensity.\n\nAgainst this backdrop, Doseology's pilot reflects an effort to evaluate how pouch-based delivery formats — independent of nicotine — may be applied to caffeine-based energy use cases, emphasizing control, consistency, and user choice in how energy is accessed. The pilot is exploratory in nature and does not represent a commercial launch.\n\n\"Feed That Brain was created to support focus and performance in everyday life,\" said Joseph Mimran, co-founder of Feed That Brain and an equity holder of Doseology Sciences Inc. \"I'm encouraged by Doseology's disciplined approach to product development, regulatory compliance, and brand building as this next chapter unfolds.\"\n\n**Pilot Scope and Next Steps**\n\nThe Feed That Brain pilot run is expected to be introduced through a limited direct-to-consumer initiative within the coming weeks, with timing to be announced by management. The pilot is designed to generate real-world insights and operational feedback, supporting Doseology's broader objectives to refine delivery formats, strengthen commercialization capabilities, and evaluate scalable pathways for future product development.\n\n**About Doseology Sciences Inc**. **(CSE: MOOD, PINK: DOSEF, FSE: VU70)**\n\nDoseology Sciences Inc. operates in the oral stimulant sector as a next-generation platform focused on rethinking how consumers access energy and stimulation through better-for-you formats. The Company emphasizes product innovation, intellectual property development, capacity ownership, and disciplined commercial execution, and pursues measured growth through internal development and selective strategic acquisitions.",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:38:51",
    "url": "https://www.reddit.com/r/10xPennyStocks/comments/1qnfkes/doseology_begins_pilot_production_of/"
  },
  {
    "platform": "Reddit",
    "content": "I need some help with my resume. I am posting it here, because I think I can get genuine reviews.",
    "author": "Effective_Cress_2746",
    "date": "2026-01-26T18:30:50",
    "url": "https://i.redd.it/66qldcg4zofg1.png"
  },
  {
    "platform": "Reddit",
    "content": "*CSE: AIML | OTCQB: AIMLF | FWB: 42FB*\n\nAI/ML Innovations Inc. (AIML) announced it had formed a strategic partnership with Movesense Ltd. (a wearable medical device manufacturer based in Finland) under which Movesense has become a designated partner for the supply of wearable ECG hardware to be used by NeuralCloud Solutions Inc. (the AIML subsidiary). The partnership will allow for the creation of bundled cardiac monitoring solutions for wearable ECG hardware and AI-based analytical capabilities.\n\nThe partnership places AIML in a better position to offer integrated AI-based and device-based cardiac monitoring solutions for clinical, research, wellness and performance markets, thereby further solidifying AIML’s plan to embed AI-based solutions into the workflows of cardiac monitoring professionals.\n\n# What Was Announced\n\nNeuralCloud will combine Movesense’s wearable single-lead ECG sensor with their proprietary AI software stacks:\n\n• **MaxYieldTM** : the AI engine responsible for the denoising of the ECG signal, PQRST wave label identification and machine readable interval identification;\n\n• **CardioYieldTM** : structured Holter-style ECG review and reporting workflows;\n\n• **Insight360TM** : no-code, drag-and-drop dashboard for ECG visualization and customizable reporting.\n\nBy combining Movesense’s wearable ECG hardware with NeuralCloud’s AI-driven analytical capabilities, AIML is moving beyond offering either standalone software solutions or hardware solutions towards creating complete cardiac monitoring solutions.\n\nhttps://preview.redd.it/cijmbip9yofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=d469eeee24708ce04db3db9ae55dc371ccde3e78\n\n# Why This Collaboration Is Important\n\nMovesense offers a well-proven, programmable and low-cost wearable ECG hardware foundation for single-lead medical devices, typically worn as a chest strap or body-worn. Combining Movesense wearable ECG hardware with NeuralCloud’s AI-driven analytical capabilities, AIML is able to move beyond the offerings of standalone software or hardware towards a completely integrated cardiac monitoring solution.\n\nThe combination of wearable ECG hardware and AI-driven analytical capabilities enable:\n\n• End-to-end ECG workflows from data capture to clinical-style reporting;  \n• Faster deployments for partners wishing to implement turn-key cardiac monitoring solutions;  \n• Greater control over data quality, interoperability and workflow design.\n\n*“This partnership strengthens our operational and commercial flexibility,” said Erik Suokas, Chief Operating Officer of AI/ML Innovations. “Movesense provides a proven, scalable device platform that allows us to bundle hardware and AI software into unified offerings.*\n\n*“Movesense was built to enable flexible, high-quality ECG acquisition across a wide range of applications,” said Jussi Kaasinen, CEO of Movesense. “Partnering with NeuralCloud allows our wearable devices to be paired with advanced AI-driven analysis and reporting.”*\n\n# Pathway to Holter-Style Monitoring\n\nOne of the main strategic implications of this collaboration is the ability to address areas traditionally served by higher-cost Holter monitoring systems. By combining scalable single-lead wearable ECG sensors with AI-driven signal processing, labeling and reporting, NeuralCloud is looking to provide cost-effective alternatives that can complement and/or potentially replace traditional Holter workflows.\n\nCardioYieldTM enables structured Holter-style analysis and MaxYieldTM ensures signal quality and labeling of the ECG waveform consistent with clinical review standards. This presents a pathway to expand the use of extended ECG monitoring using more accessible hardware while maintaining alignment with regulatory and clinical standards.\n\nhttps://preview.redd.it/qjh4vx8cyofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=811a9958d4ffa2ec7a090a9a5d41c90f56e26234\n\n# Expansion of Market\n\nBundled ECG offerings serve several end-markets:\n\n• Clinical and regulated healthcare environments, where structured ECG reporting and workflow integration are necessary;\n\n• Research and performance monitoring, including sports science and applied physiology;\n\n• Wellness and preventive health, supported by Insight360TM’s configurable, no-code reporting tools.\n\nMovesense’s presence in both medical and non-medical device formats allows NeuralCloud to develop solutions for both regulated and unregulated environments without fragmenting its software stack.\n\n# Alignment of the Collaboration with AIML’s Strategy\n\nFor AIML, the collaboration aligns with a broader strategy to embed AI-powered cardiac intelligence directly into real world workflows. By packaging hardware and software into a unified solution, AIML strengthens its go-to-market position, increases commercial flexibility and decreases dependence on third party hardware ecosystems.\n\nManagement emphasized the partnership will lead to faster deployments, greater access to new markets and more competitive pricing for solutions in all three use cases (wellness, monitoring and clinical).\n\nhttps://preview.redd.it/nj1af2tdyofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=14292e599eda951c8d90324ba523b07fcfcd9e46\n\n# Market Context and Ownership Structure\n\nAs of January 2026, AIML shares are trading at approximately CAD $0.035, or a market capitalization of about CAD $6.6 million.\n\nThe trading range of AIML shares over the last year spans approximately CAD $0.03 to CAD $0.18. AIML shares are currently trading at the bottom of this range. Prior to 2025, AIML shares traded at levels significantly above this level due to commercial deployments and term sheet agreements related to CardioYieldTM and Holter-style analysis platforms.\n\nFrom a capital structure perspective, AIML has approximately 253.9 million shares outstanding, 16 million options and 190.7 million warrants, for a fully diluted share count of approximately 460.6 million. This information is relevant to evaluate AIML’s valuation, optionality and the potential for future commercialization success.\n\nhttps://preview.redd.it/9rrtsw8fyofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=bd1c16423c3e015e7b93951fb5c03b15a1f6d3f2\n\n# Conclusion\n\nThe NeuralCloud-Movesense collaboration represents a significant advancement in AIML (AIML | OTCQB: AIMLF | FWB: 42FB)’s transition from an AI analytics provider to a full-stack, device-enabled cardiac monitoring provider. By combining wearable ECG hardware with proprietary AI software, AIML is positioning itself to play a more direct role in scalable, cost-efficient ECG monitoring markets, including those that have historically utilized Holter systems.\n\nWhether or not future commercial success occurs, the collaboration enhances AIML’s product portfolio, expands its addressable markets and reaffirms AIML’s commitment to delivering comprehensive, AI-based cardiac monitoring solutions versus providing stand-alone software solutions.",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:27:03",
    "url": "https://www.reddit.com/r/UltimateTraders/comments/1qnfb0c/aiml_neuralcloud_expands_bundled_ecg_solutions/"
  },
  {
    "platform": "Reddit",
    "content": "**CSE: AIML | OTCQB: AIMLF | FWB: 42FB**\n\nAI/ML Innovations Inc. (AIML) announced it had formed a strategic partnership with Movesense Ltd. (a wearable medical device manufacturer based in Finland) under which Movesense has become a designated partner for the supply of wearable ECG hardware to be used by NeuralCloud Solutions Inc. (the AIML subsidiary). The partnership will allow for the creation of bundled cardiac monitoring solutions for wearable ECG hardware and AI-based analytical capabilities.\n\nThe partnership places AIML in a better position to offer integrated AI-based and device-based cardiac monitoring solutions for clinical, research, wellness and performance markets, thereby further solidifying AIML’s plan to embed AI-based solutions into the workflows of cardiac monitoring professionals.\n\n**What Was Announced**\n\nNeuralCloud will combine Movesense’s wearable single-lead ECG sensor with their proprietary AI software stacks:\n\n• **MaxYieldTM** : the AI engine responsible for the denoising of the ECG signal, PQRST wave label identification and machine readable interval identification;\n\n• **CardioYieldTM** : structured Holter-style ECG review and reporting workflows;\n\n• **Insight360TM** : no-code, drag-and-drop dashboard for ECG visualization and customizable reporting.\n\nBy combining Movesense’s wearable ECG hardware with NeuralCloud’s AI-driven analytical capabilities, AIML is moving beyond offering either standalone software solutions or hardware solutions towards creating complete cardiac monitoring solutions.\n\nhttps://preview.redd.it/95clt5wuxofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=b9975a54c4398bc24c4c84fa2adb4bfd5f3003c2\n\n**Why This Collaboration Is Important**\n\nMovesense offers a well-proven, programmable and low-cost wearable ECG hardware foundation for single-lead medical devices, typically worn as a chest strap or body-worn. Combining Movesense wearable ECG hardware with NeuralCloud’s AI-driven analytical capabilities, AIML is able to move beyond the offerings of standalone software or hardware towards a completely integrated cardiac monitoring solution.\n\nThe combination of wearable ECG hardware and AI-driven analytical capabilities enable:\n\n• End-to-end ECG workflows from data capture to clinical-style reporting;  \n• Faster deployments for partners wishing to implement turn-key cardiac monitoring solutions;  \n• Greater control over data quality, interoperability and workflow design.\n\n*“This partnership strengthens our operational and commercial flexibility,” said Erik Suokas, Chief Operating Officer of AI/ML Innovations. “Movesense provides a proven, scalable device platform that allows us to bundle hardware and AI software into unified offerings.*\n\n*“Movesense was built to enable flexible, high-quality ECG acquisition across a wide range of applications,” said Jussi Kaasinen, CEO of Movesense. “Partnering with NeuralCloud allows our wearable devices to be paired with advanced AI-driven analysis and reporting.”*\n\n**Pathway to Holter-Style Monitoring**\n\nOne of the main strategic implications of this collaboration is the ability to address areas traditionally served by higher-cost Holter monitoring systems. By combining scalable single-lead wearable ECG sensors with AI-driven signal processing, labeling and reporting, NeuralCloud is looking to provide cost-effective alternatives that can complement and/or potentially replace traditional Holter workflows.\n\nCardioYieldTM enables structured Holter-style analysis and MaxYieldTM ensures signal quality and labeling of the ECG waveform consistent with clinical review standards. This presents a pathway to expand the use of extended ECG monitoring using more accessible hardware while maintaining alignment with regulatory and clinical standards.\n\nhttps://preview.redd.it/6t5rxx4xxofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=7ad9ebeef8dd62a30d2624316f3d288bdfa853f2\n\n**Expansion of Market**\n\nBundled ECG offerings serve several end-markets:\n\n• Clinical and regulated healthcare environments, where structured ECG reporting and workflow integration are necessary;\n\n• Research and performance monitoring, including sports science and applied physiology;\n\n• Wellness and preventive health, supported by Insight360TM’s configurable, no-code reporting tools.\n\nMovesense’s presence in both medical and non-medical device formats allows NeuralCloud to develop solutions for both regulated and unregulated environments without fragmenting its software stack.\n\n**Alignment of the Collaboration with AIML’s Strategy**\n\nFor AIML, the collaboration aligns with a broader strategy to embed AI-powered cardiac intelligence directly into real world workflows. By packaging hardware and software into a unified solution, AIML strengthens its go-to-market position, increases commercial flexibility and decreases dependence on third party hardware ecosystems.\n\nManagement emphasized the partnership will lead to faster deployments, greater access to new markets and more competitive pricing for solutions in all three use cases (wellness, monitoring and clinical).\n\nhttps://preview.redd.it/0bdl80xyxofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=7676b943630086a984366dc2ed9829ee9b15c441\n\n**Market Context and Ownership Structure**\n\nAs of January 2026, AIML shares are trading at approximately CAD $0.035, or a market capitalization of about CAD $6.6 million.\n\nThe trading range of AIML shares over the last year spans approximately CAD $0.03 to CAD $0.18. AIML shares are currently trading at the bottom of this range. Prior to 2025, AIML shares traded at levels significantly above this level due to commercial deployments and term sheet agreements related to CardioYieldTM and Holter-style analysis platforms.\n\nFrom a capital structure perspective, AIML has approximately 253.9 million shares outstanding, 16 million options and 190.7 million warrants, for a fully diluted share count of approximately 460.6 million. This information is relevant to evaluate AIML’s valuation, optionality and the potential for future commercialization success.\n\nhttps://preview.redd.it/1c7g6181yofg1.png?width=1112&amp;format=png&amp;auto=webp&amp;s=25e7199efd0be994dc5c043192b218d9c82049f5\n\n**Conclusion**\n\nThe NeuralCloud-Movesense collaboration represents a significant advancement in AIML (AIML | OTCQB: AIMLF | FWB: 42FB)’s transition from an AI analytics provider to a full-stack, device-enabled cardiac monitoring provider. By combining wearable ECG hardware with proprietary AI software, AIML is positioning itself to play a more direct role in scalable, cost-efficient ECG monitoring markets, including those that have historically utilized Holter systems.\n\nWhether or not future commercial success occurs, the collaboration enhances AIML’s product portfolio, expands its addressable markets and reaffirms AIML’s commitment to delivering comprehensive, AI-based cardiac monitoring solutions versus providing stand-alone software solutions.  \n",
    "author": "Fluffy-Lead6201",
    "date": "2026-01-26T18:25:25",
    "url": "https://www.reddit.com/r/CanadianStockExchange/comments/1qnf9ro/aiml_neuralcloud_expands_bundled_ecg_solutions/"
  }
]